Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationHangerOutOfHost Property
 The hanger is out of its host and will be disconnected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationHangerOutOfHost { get; }
Public Shared ReadOnly Property FabricationHangerOutOfHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationHangerOutOfHost {
	FailureDefinitionId^ get ();
}
static member FabricationHangerOutOfHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace